jacobcx/MetaWares/gen/MPC5746R_ECU/WindRiver/src/Adc_PBcfg.c
/**
*   @file    Adc_PBcfg.c
*   @version 1.0.2
*
*   @brief   AUTOSAR Adc - Post Build configuration Adc source file.
*   @details Post Build configuration file for Adc driver.
*
*   @addtogroup ADC
*   @{
*/
/*==================================================================================================
*   Project              : AUTOSAR 4.0 MCAL
*   Platform             : PA
*   Peripheral           : ADCDIG
*   Dependencies         : none
*
*   Autosar Version      : 4.0.3
*   Autosar Revision     : ASR_REL_4_0_REV_0003
*   Autosar Conf.Variant :
*   SW Version           : 1.0.2
*   Build Version        : MPC574XR_MCAL_1_0_2_RTM_ASR_REL_4_0_REV_0003_20170331
*
*   (c) Copyright (c) 2006-2016 Freescale Semiconductor, Inc. 
*       Copyright 2017 NXP
*   All Rights Reserved.
==================================================================================================*/
/*==================================================================================================
==================================================================================================*/

#ifdef __cplusplus
extern "C"{
#endif

/**
* @page misra_violations MISRA-C:2004 violations
*
* @section Adc_PBcfg_c_REF_1
* Violates MISRA 2004 Advisory Rule 19.1, only preprocessor statements and comments before '#include'
* This is an Autosar memory management requirement.
*
* @section Adc_PBcfg_c_REF_2
* Violates MISRA 2004 Required Rule 19.15, Repeated include file MemMap.h.
* This violation  is not  fixed since  the inclusion  of MemMap.h
* is as  per Autosar  requirement MEMMAP003.
*
* @section Adc_PBcfg_c_REF_3
* Violates MISRA 2004 Required Rule 1.4,
* The compiler/linker shall be checked to ensure that 31 character signifiance and case
* sensitivity are supported for external identifiers.
* This violation is due to the requirement that requests to have a file version check.
*
* @section Adc_PBcfg_c_REF_4
* Violates MISRA 2004 Required Rule 19.15, Repeated include file.
* This comes from the order of includes in the .c file and from include dependencies. As a safe
* approach, any file must include all its dependencies. Header files are already protected against
* double inclusions.
*
* @section Adc_PBcfg_c_REF_5
* Violates MISRA 2004 Required Rule 8.10, all declarations and definitions of objects or functions 
* at file scope shall have internal linkage unless external linkage is required.
* This violation is due to Autosar files and structures definitions.
*
* @section Adc_PBcfg_c_REF_6
* Violates MISRA 2004 Required Rule 9.2, Braces shall be used to indicate and match the structure in the 
* non-zero initialisation of arrays and structures. At here, we tend to initialized for whole structure, however, 
* when configure only 1 controller is configured, tool reported as non-zero initialisation. 
*
* @section [global]
* Violates MISRA 2004 Required Rule 5.1, Identifiers (internal and external) shall not rely 
* on the significance of more than 31 characters. All compilers used support more than 31 chars for
* identifiers.
*/

/*==================================================================================================
*                                        INCLUDE FILES
* 1) system and project includes
* 2) needed interfaces from external units
* 3) internal and external interfaces from this unit
==================================================================================================*/
#include "Adc.h"
/**  @violates @ref Adc_PBcfg_c_REF_4 Repeated include file */
#include "Adc_Reg_eSys_Adcdig.h"
#ifndef ADC_PRECOMPILE_SUPPORT


/*==================================================================================================
*                              SOURCE FILE VERSION INFORMATION
==================================================================================================*/
#define ADC_VENDOR_ID_PBCFG_C                    43
/*
* @violates @ref Adc_PBcfg_c_REF_3 The compiler/linker shall be checked to ensure that 31 character
* signifiance and case sensitivity are supported for external identifiers
*/
#define ADC_AR_RELEASE_MAJOR_VERSION_PBCFG_C     4
/*
* @violates @ref Adc_PBcfg_c_REF_3 The compiler/linker shall be checked to ensure that 31 character
* signifiance and case sensitivity are supported for external identifiers
*/
#define ADC_AR_RELEASE_MINOR_VERSION_PBCFG_C     0
/**
* @violates @ref Adc_PBcfg_c_REF_3 The compiler/linker shall be checked to ensure that 31 character
* signifiance and case sensitivity are supported for external identifiers
*/
#define ADC_AR_RELEASE_REVISION_VERSION_PBCFG_C  3
#define ADC_SW_MAJOR_VERSION_PBCFG_C             1
#define ADC_SW_MINOR_VERSION_PBCFG_C             0
#define ADC_SW_PATCH_VERSION_PBCFG_C             2

/*==================================================================================================
*                                     FILE VERSION CHECKS
==================================================================================================*/
/* Check if source file and ADC header file are of the same vendor */
#if (ADC_VENDOR_ID_PBCFG_C != ADC_VENDOR_ID)
    #error "Adc_PBcfg.c and Adc.h have different vendor ids"
#endif

/* Check if source file and ADC header file are of the same Autosar version */
#if ((ADC_AR_RELEASE_MAJOR_VERSION_PBCFG_C != ADC_AR_RELEASE_MAJOR_VERSION) || \
     (ADC_AR_RELEASE_MINOR_VERSION_PBCFG_C != ADC_AR_RELEASE_MINOR_VERSION) || \
     (ADC_AR_RELEASE_REVISION_VERSION_PBCFG_C != ADC_AR_RELEASE_REVISION_VERSION) \
    )
    #error "AutoSar Version Numbers of Adc_PBcfg.c and Adc.h are different"
#endif

/* Check if source file and ADC header file are of the same Software version */
#if ((ADC_SW_MAJOR_VERSION_PBCFG_C != ADC_SW_MAJOR_VERSION) || \
     (ADC_SW_MINOR_VERSION_PBCFG_C != ADC_SW_MINOR_VERSION) || \
     (ADC_SW_PATCH_VERSION_PBCFG_C != ADC_SW_PATCH_VERSION) \
    )
    #error "Software Version Numbers of Adc_PBcfg.c and Adc.h are different"
#endif

/* Check if source file and Adc_Reg_eSys_Adcdig header file are of the same vendor */
#if (ADC_VENDOR_ID_PBCFG_C != ADC_VENDOR_ID_REG)
    #error "Adc_PBcfg.c and Adc_Reg_eSys_Adcdig.h have different vendor ids"
#endif

/* Check if source file and Adc_Reg_eSys_Adcdig header file are of the same Autosar version */
#if ((ADC_AR_RELEASE_MAJOR_VERSION_PBCFG_C != ADC_AR_RELEASE_MAJOR_VERSION_REG) || \
     (ADC_AR_RELEASE_MINOR_VERSION_PBCFG_C != ADC_AR_RELEASE_MINOR_VERSION_REG) || \
     (ADC_AR_RELEASE_REVISION_VERSION_PBCFG_C != ADC_AR_RELEASE_REVISION_VERSION_REG) \
    )
    #error "AutoSar Version Numbers of Adc_PBcfg.c and Adc_Reg_eSys_Adcdig.h are different"
#endif

/* Check if source file and Adc_Reg_eSys_Adcdig header file are of the same Software version */
#if ((ADC_SW_MAJOR_VERSION_PBCFG_C != ADC_SW_MAJOR_VERSION_REG) || \
     (ADC_SW_MINOR_VERSION_PBCFG_C != ADC_SW_MINOR_VERSION_REG) || \
     (ADC_SW_PATCH_VERSION_PBCFG_C != ADC_SW_PATCH_VERSION_REG) \
    )
    #error "Software Version Numbers of Adc_PBcfg.c and Adc_Reg_eSys_Adcdig.h are different"
#endif

/*==================================================================================================
*                          LOCAL TYPEDEFS (STRUCTURES, UNIONS, ENUMS)
==================================================================================================*/

/*==================================================================================================
*                                       LOCAL MACROS
==================================================================================================*/

/**
* @brief          Total number of groups in Config.
*
*/

#define ADC_GROUPS_1           1


/*==================================================================================================
*                                      LOCAL CONSTANTS
==================================================================================================*/
#define ADC_START_SEC_CONFIG_DATA_UNSPECIFIED
/**
 * @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include"
 *  @violates @ref Adc_PBcfg_c_REF_2 Repeated include file Memmap.h
 */
#include "MemMap.h"

/**
* @brief          Group Assignments on ADC Hardware unit 0 Configuration 1.
*
*/
static CONST(Adc_ChannelType, ADC_CONST) Adc_Group0_AssignmentPB_0_1[ADC_CFGSET1_GROUP_0_CHANNELS] =
{
    0U
};
/**
* @brief          Group Assignments on ADC Hardware unit 1 Configuration 1.
*
*/
/**
* @brief          Group Assignments on ADC Hardware unit 2 Configuration 1.
*
*/
/**
* @brief          Group Assignments on ADC Hardware unit 3 Configuration 1.
*
*/



        
/**
* @brief          Definition of ADC Hw units Configuration 1.
*/
static CONST(Adc_Adcdig_HwUnitConfigurationType, ADC_CONST) Adc_HwUnitCfgPB_1[] =
{
    /**< @brief Hardware Unit ADC0 */
    {
        /**< @brief Hardware unit id*/
        (Adc_HwUnitType)0,
        /**< @brief Main configuration for control register */
        (ADCDIG_AUTO_CLKOFF_DIS_U32 | ADCDIG_OVERWRITE_EN_U32 | ADCDIG_WRITE_RIGHT_ALIGNED_U32),
        /**< @brief Prescaler of normal mode */
        (ADCDIG_CLOCK_PRESCALER_DIV1_U32),
        /**< @brief Power down delay */
        (ADCDIG_POWERDOWN_EXIT_DELAY_VALUE_U8(15)),
        /**< @brief Mux delay value */
        (ADCDIG_MUX_DELAY_VALUE_U16((uint16)15)),
        /**< @brief VREFH */
        (uint8)0x3,
        /**< @brief VREFH */
        (uint8)0x3,
#if (ADC_EXTERNAL_CH_AVAILABLE == STD_ON)
        /**< @brief VREFH */
        (uint8)0x3,
#endif
        /**< @brief do not bypass the sampling phase */
        (uint8)0x0,
        (Adc_ConversionTimeType)0x0,
        (Adc_ConversionTimeType)0x0,
        (Adc_ConversionTimeType)0x0,
        (Adc_ConversionTimeType)0x0,
#if (ADC_CTR2_AVAILABLE == STD_ON)
        (Adc_ConversionTimeType)0x0,
        (Adc_ConversionTimeType)0x0,
#endif /* ADC_CTR2_AVAILABLE == STD_ON */
        /**< @brief Adc bit resolution. */
        (Adc_ResolutionType)ADC_BITS_RESOLUTION_12_U8

