jacobcx/MetaWares/gen/MPC5746R_ECU/WindRiver/src/Adc_PBcfg.c
    /** @violates @ref Adc_PBcfg_c_REF_6 MISRA-C:2004 Rule 9.2.*/
    }
};


#define ADC_STOP_SEC_CONFIG_DATA_UNSPECIFIED
/** @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include" */
/**  @violates @ref Adc_PBcfg_c_REF_2 Repeated include file Memmap.h*/
#include "MemMap.h"

/*==================================================================================================
*                                      LOCAL VARIABLES
==================================================================================================*/
#define ADC_START_SEC_VAR_INIT_UNSPECIFIED
/** @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include" */
/**  @violates @ref Adc_PBcfg_c_REF_2 Repeated include file Memmap.h*/
#include "MemMap.h"

/**
* @brief          Adc Result Buffer RAM initializations.
* @details        Array for all ADC group result ram buffers.
*/
static P2VAR(Adc_ValueGroupType, ADC_VAR, ADC_APPL_DATA) Adc_ResultsBufferPtr[] =
{
    NULL_PTR
};


#define ADC_STOP_SEC_VAR_INIT_UNSPECIFIED
/** @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include" */
/**  @violates @ref Adc_PBcfg_c_REF_2 Repeated include file Memmap.h*/
#include "MemMap.h"

/*==================================================================================================
*                                       GLOBAL FUNCTIONS
==================================================================================================*/
#define ADC_START_SEC_CODE
/**
 * @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include"
 * @violates @ref Adc_PBcfg_c_REF_2 Repeated include file Memmap.h
 */
#include "MemMap.h"






#define ADC_STOP_SEC_CODE
/** @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include" */
/** @violates @ref Adc_PBcfg_c_REF_2 Repeated include file Memmap.h*/
#include "MemMap.h"

#define ADC_START_SEC_CONFIG_DATA_UNSPECIFIED
/** @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include" */
/** @violates @ref Adc_PBcfg_c_REF_2 Repeated include file Memmap.h*/
#include "MemMap.h"

/**
* @brief          Definition of channels on ADC Hardware unit 0 - Configuration 1.
* @details        Array of conversion command messages
*/
static CONST(Adc_Adcdig_ChannelConfigurationType, ADC_CONST) Adc_ChannelsCfgPB_0_1[] =
{
    /**< @brief Hardware Unit ADC0  --  AN_0 */
    {

        /**< @brief Adc physical channel */
        (Adc_ChannelType)(ADC_ID_CHANNEL_U8(0)),
#ifdef ADC_WDG_SUPPORTED
        /**< @brief Threshold register configured */
        ADC_UNUSED_THRESHOLD_U8,
        /**< @brief No WDOG notification */
        NULL_PTR,
        /**< @brief Channel descriptions for the WDG interrupts */
        (uint8)0,
        /**< @brief Channel descriptions Mask for the WDG interrupts */
        (uint32)0x00000001,
#endif /* ADC_WDG_SUPPORTED */
        /**< @brief presampling disabled */
        (uint8)0x0
    }
};


#define ADC_STOP_SEC_CONFIG_DATA_UNSPECIFIED
/** @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include" */
/** @violates @ref Adc_PBcfg_c_REF_2 Repeated include file Memmap.h*/
#include "MemMap.h"
/*==================================================================================================
*                                      GLOBAL VARIABLES
==================================================================================================*/

#define ADC_START_SEC_VAR_INIT_UNSPECIFIED
/** @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include" */
/** @violates @ref Adc_PBcfg_c_REF_2 Repeated include file Memmap.h*/
#include "MemMap.h"

/**
* @brief          Definition of channels's pointer structure Configuration 1.
*
*/
static P2CONST(Adc_Adcdig_ChannelConfigurationType, ADC_VAR, ADC_APPL_CONST) Adc_ChannelsCfgPB_1[] =
{
    Adc_ChannelsCfgPB_0_1,
    NULL_PTR,
    NULL_PTR,
    NULL_PTR
};

#define ADC_STOP_SEC_VAR_INIT_UNSPECIFIED
/** @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include" */
/** @violates @ref Adc_PBcfg_c_REF_2 Repeated include file Memmap.h*/
#include "MemMap.h"
/*==================================================================================================
*                                      GLOBAL CONSTANTS
==================================================================================================*/
#define ADC_START_SEC_CONFIG_DATA_UNSPECIFIED
/** @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include" */
/**  @violates @ref Adc_PBcfg_c_REF_2 Repeated include file Memmap.h*/
#include "MemMap.h"



/**
* @brief          Definition of all ADC groups for configuration 1.
*/
static CONST(Adc_GroupConfigurationType, ADC_CONST) Adc_GroupsCfgPB_1[] =
{
    /**< @brief Group0 -- Hardware Unit ADC0 */
    {
        /**< @brief Hardware unit configured */
        (Adc_HwUnitType)0,
        /**< @brief Access mode */
        ADC_ACCESS_MODE_SINGLE,
        /**< @brief Conversion mode */
        ADC_CONV_MODE_ONESHOT,
        /**< @brief Conversion type */
        ADC_CONV_TYPE_NORMAL,
#if (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE)
        /**< @brief Priority configured */
        ((Adc_GroupPriorityType)(0U)),
#endif /* ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE */
        /**< @brief Replacement mode */
        ADC_GROUP_REPL_ABORT_RESTART,
        /**< @brief Trigger source configured */
        ADC_TRIGG_SRC_SW,
#if (STD_ON==ADC_HW_TRIGGER_API)
#if (STD_ON == ADC_MULTIPLE_HARDWARE_TRIGGERS)
        /**< @brief This a Regular Group */
        (Adc_MhtGroupType)ADC_REGULAR_GROUP_TYPE,
#endif /* (STD_ON == ADC_MULTIPLE_HARDWARE_TRIGGERS) */
        /**< @brief Hardware trigger signal */
        ADC_HW_TRIG_BOTH_EDGES,
        /**< @brief Hardware resource for the group*/
        0U,
#endif /* (STD_ON==ADC_HW_TRIGGER_API) */
#if (STD_ON==ADC_GRP_NOTIF_CAPABILITY)
        /**< @brief Notification function */
        NULL_PTR,
#endif /* (STD_ON==ADC_GRP_NOTIF_CAPABILITY) */
#if (ADC_ENABLE_INITIAL_NOTIFICATION == STD_ON)
        /**< @brief Extra notification function */

        NULL_PTR,
#endif
        /**< @brief Precision configured channels */
        (uint32)0x1U,
#if (ADC_EXTENDED_CH_AVAILABLE == STD_ON)
        /**< @brief Extended configured channels */
        (uint32)0x0U,
#endif
#if (ADC_EXTERNAL_CH_AVAILABLE == STD_ON)
        /**< @brief External configured channels */
        (uint32)0x0U,
#endif
        /**< @brief Presampling for Precision channels */
        (uint32)0x0U,
#if (ADC_EXTENDED_CH_AVAILABLE == STD_ON)
        /**< @brief Presampling for Extended channels */
        (uint32)0x0U,
#endif
#if (ADC_EXTERNAL_CH_AVAILABLE == STD_ON)
        /**< @brief Presampling for External channels */
        (uint32)0x0U,
#endif
        /**< @brief Wer0 for precision channels */
        (uint32)0x0U,
#if (ADC_EXTENDED_CH_AVAILABLE == STD_ON)
        /**< @brief Wer1 for extended(medi.accuracy channels) */
        (uint32)0x0U,
#endif
#if (ADC_EXTERNAL_CH_AVAILABLE == STD_ON)
        /**< @brief Wer2 for external channels */
        (uint32)0x0U,
#endif
        /**< @brief ADC Group Result Buffers RAM array */
        Adc_ResultsBufferPtr,
        /**< @brief Group Streaming Buffer Mode */
        ADC_STREAM_BUFFER_LINEAR,
#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
        /**< @brief Index of the group with AdcEnableChDisableChGroup enabled */
        (Adc_GroupType)ADC_ENABLE_CH_DISABLE_CH_INVALID_GROUP_INDEX,
#endif /* (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) */
        /**< @brief Number of streaming samples */
        (Adc_StreamNumSampleType)ADC_STREAMING_NUM_SAMPLES(1),
        /**< @brief Channels assigned to the group*/
        Adc_Group0_AssignmentPB_0_1,
        /**< @brief Number of channels in the group*/
        (Adc_ChannelIndexType)ADC_CFGSET1_GROUP_0_CHANNELS,
        (Adc_ConversionTimeType)(ADCDIG_INPSAMP_VALUE_U32(8)),
        (Adc_ConversionTimeType)(ADCDIG_INPSAMP_VALUE_U32(8)),
        (Adc_ConversionTimeType)(ADCDIG_INPSAMP_VALUE_U32(8)),
        /**< @brief Last Channel configured */
        (Adc_ChannelType)(ADC_ID_CHANNEL_U8(0)),
        /**< @brief First Channel Configured */
        (Adc_ChannelType)(ADC_ID_CHANNEL_U8(0)),
        /**< @brief Enables or Disables the ADC and DMA interrupts */
        (uint8)STD_OFF
#if (STD_ON == ADC_ENABLE_DOUBLE_BUFFERING)
        ,
        /**< @brief Enables or Disables the ADC double buffering feature */
        (uint8)STD_OFF
#endif /* (STD_ON == ADC_ENABLE_DOUBLE_BUFFERING) */
    }
};


/**
* @brief          ADC driver Configuration structure 1.
*/
/** @violates @ref Adc_PBcfg_c_REF_5 MISRA-C:2004 Rule 8.10: External linkage.*/
CONST(Adc_ConfigType, ADC_CONST) AdcConfigSet =
{
    /**< @brief pointer to Hw unit configurations */
    Adc_HwUnitCfgPB_1,
    /**< @brief pointer to group configurations */
    Adc_GroupsCfgPB_1,
    /**< @brief pointer to channel configurations */
    Adc_ChannelsCfgPB_1,
    /**< @brief total number of groups */
    (Adc_GroupType)ADC_GROUPS_1,
    /**< @brief Miscellaneous configuration parameters. - Adc_Adcdig_MultiConfigType */
    {
        {
            ADC_INTERRUPT,
            ADC_INTERRUPT,
            ADC_INTERRUPT,
            ADC_INTERRUPT
        },
        /**< @brief number of the maximum hardware units in the current configuration */
        1U,
        {
            /**< @brief number of groups of the hw unit 0 */
            (Adc_GroupType)1U,
            /**< @brief number of groups of the hw unit 1 */
            (Adc_GroupType)0U,
            /**< @brief number of groups of the hw unit 2 */
            (Adc_GroupType)0U,
            /**< @brief number of groups of the hw unit 3 */
            (Adc_GroupType)0U
        },
        {
            /**< @brief number of channels of the ADC Hardware unit 0 */
            (Adc_ChannelType)1U,
            /**< @brief number of channels of the ADC Hardware unit 1 */
            (Adc_ChannelType)0U,
            /**< @brief number of channels of the ADC Hardware unit 2 */
            (Adc_ChannelType)0U,
            /**< @brief number of channels of the ADC Hardware unit 3 */
            (Adc_ChannelType)0U
        },
        {
            /** The DMA channel number for ADC 0 */
            (uint8)255U,
            /** The DMA channel number for ADC 1 */
            (uint8)255U,
            /** The DMA channel number for ADC 2 */
            (uint8)255U,
            /** The DMA channel number for ADC 3 */
            (uint8)255U
        },
        {
            /**< @brief ADC_UNIT_0 - ON/OFF */
            (uint8)STD_ON,
            /**< @brief ADC_UNIT_1 - ON/OFF */
            (uint8)STD_OFF,
            /**< @brief ADC_UNIT_2 - ON/OFF */
            (uint8)STD_OFF,
            /**< @brief ADC_UNIT_3 - ON/OFF */
            (uint8)STD_OFF
        },
#if (STD_ON == ADC_MULTIPLE_HARDWARE_TRIGGERS)        
        {
            /**< @brief number of MHT groups of the ADC Hardware unit 0 */
            (uint8)0U,
            /**< @brief number of MHT groups of the ADC Hardware unit 1 */
            (uint8)0U,
            /**< @brief number of MHT groups of the ADC Hardware unit 2 */
            (uint8)0U,
            /**< @brief number of MHT groups of the ADC Hardware unit 3 */
            (uint8)0U
        },
#endif           
        {
            0U,
            255U,
            255U,
            255U
        }
    }
};



