jacobcx/MetaWares/gen/MPC5746R_ECU/WindRiver/src/Adc_PBcfg.c
/**
* @brief          ADC Registers available for each unit .
*/
/** @violates @ref Adc_Cfg_c_REF_5 MISRA-C:2004 Rule 8.10: External linkage.*/
CONST(Adc_Adcdig_RegisterAvailabilityType, ADC_CONST) Adc_RegistersAvailable =
{
    /**< @brief ADC Registers available for each Unit. - Adc_Adcdig_RegisterAvailabilityType */
    {
            {
               /**< @brief ADC_CEOCFR0 available on unit ADC0 */
            (uint8)STD_ON, 
               /**< @brief ADC_CEOCFR1 available on unit ADC0 */
            (uint8)STD_ON, 
               /**< @brief ADC_CEOCFR2 available on unit ADC0 */
            (uint8)STD_OFF
            }, 
            {
               /**< @brief ADC_CEOCFR0 available on unit ADC1 */
            (uint8)STD_ON, 
               /**< @brief ADC_CEOCFR1 available on unit ADC1 */
            (uint8)STD_ON, 
               /**< @brief ADC_CEOCFR2 available on unit ADC1 */
            (uint8)STD_OFF
            }, 
            {
               /**< @brief ADC_CEOCFR0 available on unit ADC2 */
            (uint8)STD_ON, 
               /**< @brief ADC_CEOCFR1 available on unit ADC2 */
            (uint8)STD_ON, 
               /**< @brief ADC_CEOCFR2 available on unit ADC2 */
            (uint8)STD_OFF
            }, 
            {
               /**< @brief ADC_CEOCFR0 available on unit ADC3 */
            (uint8)STD_ON, 
               /**< @brief ADC_CEOCFR1 available on unit ADC3 */
            (uint8)STD_ON, 
               /**< @brief ADC_CEOCFR2 available on unit ADC3 */
            (uint8)STD_ON
            }
        },
        {
        {
            /**< @brief ADC_DMAR0 available on unit ADC0 */
            (uint8)STD_ON, 
            /**< @brief ADC_DMAR1 available on unit ADC0 */
            (uint8)STD_ON, 
            /**< @brief ADC_DMAR2 available on unit ADC0 */
            (uint8)STD_OFF
        }, 
        {
            /**< @brief ADC_DMAR0 available on unit ADC1 */
            (uint8)STD_ON, 
            /**< @brief ADC_DMAR1 available on unit ADC1 */
            (uint8)STD_ON, 
            /**< @brief ADC_DMAR2 available on unit ADC1 */
            (uint8)STD_OFF
        }, 
        {
            /**< @brief ADC_DMAR0 available on unit ADC2 */
            (uint8)STD_ON, 
            /**< @brief ADC_DMAR1 available on unit ADC2 */
            (uint8)STD_ON, 
            /**< @brief ADC_DMAR2 available on unit ADC2 */
            (uint8)STD_OFF
        }, 
        {
            /**< @brief ADC_DMAR0 available on unit ADC3 */
            (uint8)STD_ON, 
            /**< @brief ADC_DMAR1 available on unit ADC3 */
            (uint8)STD_ON, 
            /**< @brief ADC_DMAR2 available on unit ADC3 */
            (uint8)STD_ON
        }
    },
    {
        {
            /**< @brief ADC_PSR0 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_PSR1 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_PSR2 available on unit ADC0 */ 
            (uint8)STD_OFF
        }, 
        {
            /**< @brief ADC_PSR0 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_PSR1 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_PSR2 available on unit ADC1 */ 
            (uint8)STD_OFF
        }, 
        {
            /**< @brief ADC_PSR0 available on unit ADC2 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_PSR1 available on unit ADC2 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_PSR2 available on unit ADC2 */ 
            (uint8)STD_OFF
        }, 
        {
            /**< @brief ADC_PSR0 available on unit ADC3 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_PSR1 available on unit ADC3 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_PSR2 available on unit ADC3 */ 
            (uint8)STD_ON
        }
    },
    {
        {
            /**< @brief ADC_CTR0 available on unit ADC0 */  
            (uint8)STD_ON, 
            /**< @brief ADC_CTR1 available on unit ADC0 */  
            (uint8)STD_ON, 
            /**< @brief ADC_CTR2 available on unit ADC0 */  
            (uint8)STD_OFF
        }, 
        {
            /**< @brief ADC_CTR0 available on unit ADC1 */  
            (uint8)STD_ON, 
            /**< @brief ADC_CTR1 available on unit ADC1 */  
            (uint8)STD_ON, 
            /**< @brief ADC_CTR2 available on unit ADC1 */  
            (uint8)STD_OFF
        }, 
        {
            /**< @brief ADC_CTR0 available on unit ADC2 */  
            (uint8)STD_ON, 
            /**< @brief ADC_CTR1 available on unit ADC2 */  
            (uint8)STD_ON, 
            /**< @brief ADC_CTR2 available on unit ADC2 */  
            (uint8)STD_OFF
        }, 
        {
            /**< @brief ADC_CTR0 available on unit ADC3 */  
            (uint8)STD_ON, 
            /**< @brief ADC_CTR1 available on unit ADC3 */  
            (uint8)STD_ON, 
            /**< @brief ADC_CTR2 available on unit ADC3 */  
            (uint8)STD_ON
        }
    },
    {
        {
            /**< @brief ADC_NCMR0 available on unit ADC0 */  
            (uint8)STD_ON, 
            /**< @brief ADC_NCMR1 available on unit ADC0 */  
            (uint8)STD_ON, 
            /**< @brief ADC_NCMR2 available on unit ADC0 */  
            (uint8)STD_OFF
        }, 
        {
            /**< @brief ADC_NCMR0 available on unit ADC1 */  
            (uint8)STD_ON, 
            /**< @brief ADC_NCMR1 available on unit ADC1 */  
            (uint8)STD_ON, 
            /**< @brief ADC_NCMR2 available on unit ADC1 */  
            (uint8)STD_OFF
        }, 
        {
            /**< @brief ADC_NCMR0 available on unit ADC2 */  
            (uint8)STD_ON, 
            /**< @brief ADC_NCMR1 available on unit ADC2 */  
            (uint8)STD_ON, 
            /**< @brief ADC_NCMR2 available on unit ADC2 */  
            (uint8)STD_OFF
        }, 
        {
            /**< @brief ADC_NCMR0 available on unit ADC3 */  
            (uint8)STD_ON, 
            /**< @brief ADC_NCMR1 available on unit ADC3 */  
            (uint8)STD_ON, 
            /**< @brief ADC_NCMR2 available on unit ADC3 */  
            (uint8)STD_ON
        }
    },
    {
        {
            /**< @brief ADC_JCMR0 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_JCMR1 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_JCMR2 available on unit ADC0 */ 
            (uint8)STD_OFF
        }, 
        {
            /**< @brief ADC_JCMR0 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_JCMR1 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_JCMR2 available on unit ADC1 */ 
            (uint8)STD_OFF
        }, 
        {
            /**< @brief ADC_JCMR0 available on unit ADC2 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_JCMR1 available on unit ADC2 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_JCMR2 available on unit ADC2 */ 
            (uint8)STD_OFF
        }, 
        {
            /**< @brief ADC_JCMR0 available on unit ADC3 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_JCMR1 available on unit ADC3 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_JCMR2 available on unit ADC3 */ 
            (uint8)STD_ON
        }
    },
    {
            /**< @brief DSDR register available on unit ADC0 */ 
            (uint8)STD_OFF, 
            /**< @brief DSDR register available on unit ADC1 */ 
            (uint8)STD_OFF, 
            /**< @brief DSDR register available on unit ADC2 */ 
            (uint8)STD_OFF, 
            /**< @brief DSDR register available on unit ADC3 */ 
            (uint8)STD_ON
    },
    {
        {
            /**< @brief ADC_CWSEL0 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL1 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL2 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL3 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL4 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL5 available on unit ADC0 */ 
            (uint8)STD_OFF, 
            /**< @brief ADC_CWSEL6 available on unit ADC0 */ 
            (uint8)STD_OFF, 
            /**< @brief ADC_CWSEL7 available on unit ADC0 */ 
            (uint8)STD_OFF, 
            /**< @brief ADC_CWSEL8 available on unit ADC0 */ 
            (uint8)STD_OFF, 
            /**< @brief ADC_CWSEL9 available on unit ADC0 */ 
            (uint8)STD_OFF, 
            /**< @brief ADC_CWSEL10 available on unit ADC0 */ 
            (uint8)STD_OFF, 
            /**< @brief ADC_CWSEL11 available on unit ADC0 */ 
            (uint8)STD_OFF
        }, 
        {
            /**< @brief ADC_CWSEL0 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL1 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL2 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL3 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL4 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL5 available on unit ADC1 */ 
            (uint8)STD_OFF, 
            /**< @brief ADC_CWSEL6 available on unit ADC1 */ 
            (uint8)STD_OFF, 
            /**< @brief ADC_CWSEL7 available on unit ADC1 */ 
            (uint8)STD_OFF, 
            /**< @brief ADC_CWSEL8 available on unit ADC1 */ 
            (uint8)STD_OFF, 
            /**< @brief ADC_CWSEL9 available on unit ADC1 */ 
            (uint8)STD_OFF, 
            /**< @brief ADC_CWSEL10 available on unit ADC1 */ 
            (uint8)STD_OFF, 
            /**< @brief ADC_CWSEL11 available on unit ADC1 */ 
            (uint8)STD_OFF
        }, 
        {
            /**< @brief ADC_CWSEL0 available on unit ADC2 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL1 available on unit ADC2 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL2 available on unit ADC2 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL3 available on unit ADC2 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL4 available on unit ADC2 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL5 available on unit ADC2 */ 
            (uint8)STD_OFF, 
            /**< @brief ADC_CWSEL6 available on unit ADC2 */ 
            (uint8)STD_OFF, 
            /**< @brief ADC_CWSEL7 available on unit ADC2 */ 
            (uint8)STD_OFF, 
            /**< @brief ADC_CWSEL8 available on unit ADC2 */ 
            (uint8)STD_OFF, 
            /**< @brief ADC_CWSEL9 available on unit ADC2 */ 
            (uint8)STD_OFF, 
            /**< @brief ADC_CWSEL10 available on unit ADC2 */ 
            (uint8)STD_OFF, 
            /**< @brief ADC_CWSEL11 available on unit ADC2 */ 
            (uint8)STD_OFF
        }, 
        {
            /**< @brief ADC_CWSEL0 available on unit ADC3 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL1 available on unit ADC3 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL2 available on unit ADC3 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL3 available on unit ADC3 */ 
            (uint8)STD_OFF, 
            /**< @brief ADC_CWSEL4 available on unit ADC3 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL5 available on unit ADC3 */ 
            (uint8)STD_OFF, 
            /**< @brief ADC_CWSEL6 available on unit ADC3 */ 
            (uint8)STD_OFF, 
            /**< @brief ADC_CWSEL7 available on unit ADC3 */ 
            (uint8)STD_OFF, 
            /**< @brief ADC_CWSEL8 available on unit ADC3 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL9 available on unit ADC3 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL10 available on unit ADC3 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWSEL11 available on unit ADC3 */ 
            (uint8)STD_ON
        }
    },
    {
        {
            /**< @brief ADC_CWENR0 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWENR1 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWENR2 available on unit ADC0 */ 
            (uint8)STD_OFF
        }, 
        {
            /**< @brief ADC_CWENR0 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWENR1 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWENR2 available on unit ADC1 */ 
            (uint8)STD_OFF
        }, 
        {
            /**< @brief ADC_CWENR0 available on unit ADC2 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWENR1 available on unit ADC2 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWENR2 available on unit ADC2 */ 
            (uint8)STD_OFF
        }, 
        {
            /**< @brief ADC_CWENR0 available on unit ADC3 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWENR1 available on unit ADC3 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_CWENR2 available on unit ADC3 */ 
            (uint8)STD_ON
        }
    },
    {
        {
            /**< @brief ADC_AWORR0 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_AWORR1 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_AWORR2 available on unit ADC0 */ 
            (uint8)STD_OFF
        }, 
        {
            /**< @brief ADC_AWORR0 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_AWORR1 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_AWORR2 available on unit ADC1 */ 
            (uint8)STD_OFF
        }, 
        {
            /**< @brief ADC_AWORR0 available on unit ADC2 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_AWORR1 available on unit ADC2 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_AWORR2 available on unit ADC2 */ 
            (uint8)STD_OFF
        }, 
        {
            /**< @brief ADC_AWORR0 available on unit ADC3 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_AWORR1 available on unit ADC3 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_AWORR2 available on unit ADC3 */ 
            (uint8)STD_ON
        }
    },
    {
        {
            /**< @brief ADC_THRHLR0 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_THRHLR1 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_THRHLR2 available on unit ADC0 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_THRHLR3 available on unit ADC0 */ 
            (uint8)STD_ON
        }, 
        {
            /**< @brief ADC_THRHLR0 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_THRHLR1 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_THRHLR2 available on unit ADC1 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_THRHLR3 available on unit ADC1 */ 
            (uint8)STD_ON
        }, 
        {
            /**< @brief ADC_THRHLR0 available on unit ADC2 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_THRHLR1 available on unit ADC2 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_THRHLR2 available on unit ADC2 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_THRHLR3 available on unit ADC2 */ 
            (uint8)STD_ON
        }, 
        {
            /**< @brief ADC_THRHLR0 available on unit ADC3 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_THRHLR1 available on unit ADC3 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_THRHLR2 available on unit ADC3 */ 
            (uint8)STD_ON, 
            /**< @brief ADC_THRHLR3 available on unit ADC3 */ 
            (uint8)STD_ON
        }
    }
};


