jacobcx/MetaWares/gen/MPC5746R_ECU/WindRiver/src/Adc_PBcfg.c
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
/**
* @brief          Definition of channels limit checking on ADC Hardware unit 0.
*/
static CONST(Adc_Adcdig_ChannelLimitCheckingType, ADC_CONST) Adc_ChannelsLimitCheckingCfg_0[] =
{
    /**< @brief Hardware Unit ADC0  --  AN_0 */
    {
        /**< @brief limit check disabled */
        (boolean)FALSE,
        /**< @brief range for limit check */
        (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
        /**< @brief high limit value */
        (Adc_ValueGroupType)0,
        /**< @brief low limit value */
        (Adc_ValueGroupType)0
    }
};
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */



#define ADC_STOP_SEC_CONFIG_DATA_UNSPECIFIED
/** @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include" */
/** @violates @ref Adc_PBcfg_c_REF_2 Repeated include file Memmap.h*/
#include "MemMap.h"

#define ADC_START_SEC_VAR_INIT_UNSPECIFIED
/** @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include" */
/** @violates @ref Adc_PBcfg_c_REF_2 Repeated include file Memmap.h*/
#include "MemMap.h"
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
/**
* @brief          Definition of channels' limit checking pointer structure.
*
*/
P2CONST(Adc_Adcdig_ChannelLimitCheckingType, ADC_VAR, ADC_APPL_CONST) Adc_ChannelsLimitCheckingCfg[]=
{
    Adc_ChannelsLimitCheckingCfg_0,
    NULL_PTR,
    NULL_PTR,
    NULL_PTR
};
#endif

#define ADC_STOP_SEC_VAR_INIT_UNSPECIFIED
/** @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include" */
/** @violates @ref Adc_PBcfg_c_REF_2 Repeated include file Memmap.h*/
#include "MemMap.h"

/*==================================================================================================
*                                   LOCAL FUNCTION PROTOTYPES
==================================================================================================*/

/*==================================================================================================
*                                       LOCAL FUNCTIONS
==================================================================================================*/

#endif /* ADC_PRECOMPILE_SUPPORT */

#ifdef __cplusplus
}
#endif

/** @} */

